<?php 
    $products = [
        [
            'id'   => '1',
            'image' => 'http://jey.of.by/images/image-1.jpg',
            'name' => 'Игровой ноутбук Lenovo IdeaPad Gaming 3 15ACH6 82K2028X',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 4286,
                'new' => 2699,
            ],

        ],
        [
            'id'   => '2',
            'image' => 'http://jey.of.by/images/image-2.jpg',
            'name' => 'Игровой ноутбук ASUS TUF Gaming F15 FX506HC-HN040',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 4286,
                'new' => 0,
            ],

        ],
        [
            'id'   => '3',
            'image' => 'http://jey.of.by/images/image-3.jpg',
            'name' => 'Игровой ноутбук Lenovo LOQ 15APH8 82XT00BJ',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 4286,
                'new' => 2334,
            ],

        ],
        [
            'id'   => '4',
            'image' => 'http://jey.of.by/images/image-4.jpg',
            'name' => 'Ноутбук Lenovo IdeaPad Slim 3 16IAH8 83ES0011',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 3586,
                'new' => 0,
            ],

        ],
        [
            'id'   => '5',
            'image' => 'http://jey.of.by/images/image-5.jpg',
            'name' => 'Игровой ноутбук Lenovo IdeaPad Gaming 3 15ACH6',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 3586,
                'new' => 1234,
            ],
        ],
        [
            'id'   => '6',
            'image' => 'http://jey.of.by/images/image-6.jpg',
            'name' => 'Ноутбук ASUS Vivobook 15 X1504ZA-BQ121W',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 1567,
                'new' => 0,
            ],
        ],
        [
            'id'   => '7',
            'image' => 'http://jey.of.by/images/image-7.jpg',
            'name' => 'Ноутбук Lenovo IdeaPad 3 15IAU7 82RK00HW',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 4555,
                'new' => 1222,
            ],
        ],
        [
            'id'   => '8',
            'image' => 'http://jey.of.by/images/image-8.jpg',
            'name' => 'Ноутбук Lenovo IdeaPad 5 15ITL05 82FG00YT',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 2445,
                'new' => 8899,
            ],
        ],
        [
            'id'   => '9',
            'image' => 'http://jey.of.by/images/image-9.jpg',
            'name' => 'Ноутбук Lenovo IdeaPad 5 15ITL05 82FG00YT',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 2445,
                'new' => 8899,
            ],
        ],
        [
            'id'   => '10',
            'image' => 'http://jey.of.by/images/image-10.jpg',
            'name' => 'Ноутбук HP 15s-fq5234nw (714V3EA)',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 5544,
                'new' => 0,
            ],
        ],



        [
            'id'   => '11',
            'image' => 'http://jey.of.by/images/image-11.jpg',
            'name' => 'Игровой ноутбук Lenovo IdeaPad Gaming 3 15ACH6 82K2028X',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 4286,
                'new' => 2699,
            ],

        ],
        [
            'id'   => '12',
            'image' => 'http://jey.of.by/images/image-12.jpg',
            'name' => 'Игровой ноутбук ASUS TUF Gaming F15 FX506HC-HN040',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 4286,
                'new' => 0,
            ],

        ],
        [
            'id'   => '13',
            'image' => 'http://jey.of.by/images/image-13.jpg',
            'name' => 'Игровой ноутбук Lenovo LOQ 15APH8 82XT00BJ',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 4286,
                'new' => 2334,
            ],

        ],
        [
            'id'   => '14',
            'image' => 'http://jey.of.by/images/image-14.jpg',
            'name' => 'Ноутбук Lenovo IdeaPad Slim 3 16IAH8 83ES0011',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 3586,
                'new' => 0,
            ],

        ],
        [
            'id'   => '15',
            'image' => 'http://jey.of.by/images/image-15.jpg',
            'name' => 'Игровой ноутбук Lenovo IdeaPad Gaming 3 15ACH6',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 3586,
                'new' => 1234,
            ],
        ],
        [
            'id'   => '16',
            'image' => 'http://jey.of.by/images/image-16.jpg',
            'name' => 'Ноутбук ASUS Vivobook 15 X1504ZA-BQ121W',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 1567,
                'new' => 0,
            ],
        ],
        [
            'id'   => '17',
            'image' => 'http://jey.of.by/images/image-17.jpg',
            'name' => 'Ноутбук Lenovo IdeaPad 3 15IAU7 82RK00HW',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 4555,
                'new' => 1222,
            ],
        ],
        [
            'id'   => '18',
            'image' => 'http://jey.of.by/images/image-18.jpg',
            'name' => 'Ноутбук Lenovo IdeaPad 5 15ITL05 82FG00YT',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 2445,
                'new' => 8899,
            ],
        ],
        [
            'id'   => '19',
            'image' => 'http://jey.of.by/images/image-19.jpg',
            'name' => 'Ноутбук Lenovo IdeaPad 5 15ITL05 82FG00YT',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 2445,
                'new' => 8899,
            ],
        ],
        [
            'id'   => '20',
            'image' => 'http://jey.of.by/images/image-20.jpg',
            'name' => 'Ноутбук HP 15s-fq5234nw (714V3EA)',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 5544,
                'new' => 0,
            ],
        ],

        [
            'id'   => '21',
            'image' => 'http://jey.of.by/images/image-21.jpg',
            'name' => 'Ноутбук HP 15s-fq2619nw (6Y7X5EA)',
            'tieser' => 'Lenovo IdeaPad Gaming 3 15ACH6 82K2028X — игровой ноутбук начального уровня, который хорошо справляется с большинством современных игр, редактированием фотографий и видео. Модель получила быстрый экран, хороший объем памяти, качественную систему охлаждения и отлично подходит для интенсивного ежедневного использования.',
            'prices' => [
                'old' => 5544,
                'new' => 10,
            ],
        ]
    ];

if (!empty($_SERVER['HTTP_X_REQUESTED_WITH']) && strtolower($_SERVER['HTTP_X_REQUESTED_WITH']) == 'xmlhttprequest' )
{
    $perPage = 4;
    $page = (isset($_GET["page"])) ? intval($_GET["page"]) : 0;

    $result = array_slice($products, $page * $perPage, $perPage);

    /*$html = '';

    if(count($result) > 0)
    {
        foreach($result as $product){
            $tieser = substr($product['image'], 0, 150);
            $price = ($product["prices"]["new"] > 0) ? '<span class="price">' . $product["prices"]["new"] . ' руб.</span><span class="old-price">' . $product["prices"]["new"] . ' руб.</span>' : '<span class="price">' . $product["prices"]["old"] . ' руб.</span>';

            $html .= '
                <div class="product">
                    <div class="product-foto">
                        <img src="' . $product['image'] . '" alt="" />
                    </div>
                    <div class="product-info">
                        <div class="product-name">' . $product['name'] . '</div>
                        <div class="product-tieser">' . $tieser . '</div>
                        <div class="product-price">' . $price . '</div>
                        <div class="product-buttons">
                            <a href="#" class="button product-details">Подробнее</a>
                            <a href="#" class="button product-cart">В корзину</a>
                        </div>
                    </div>
                </div>
            ';
        }
    }

    echo $html;*/

    echo json_encode($result);

}else{?>
<h1>Temporary Empty Site</h1>
<?php }?>